[
  {
    "name": "Aloe Vera",
    "uses": "Traditionally, aloe was used topically to heal wounds and for various skin conditions, and orally as a laxative. Today, in addition to traditional uses, people take aloe orally to treat a variety of conditions, including diabetes, asthma, epilepsy, and osteoarthritis. People use aloe topically for osteoarthritis, burns, sunburns, and psoriasis. Aloe vera gel can be found in hundreds of skin products, including lotions and sunblocks. The FDA has approved aloe vera as a natural food flavoring.",
    "prep": "Aloe leaves contain a clear gel that is often used as a topical ointment. The green part of the leaf that surrounds the gel can be used to produce a juice or a dried substance (called latex) that is taken by mouth.",
    "warning": "Use of topical aloe vera is not associated with significant side effects. Abdominal cramps and diarrhea have been reported with oral use of aloe vera. Diarrhea, caused by the laxative effect of oral aloe vera, can decrease the absorption of many drugs. People with diabetes who use glucose-lowering medication should be cautious if also taking aloe by mouth because preliminary studies suggest aloe may lower blood glucose levels. There have been a few case reports of acute hepatitis from aloe vera taken orally. However, the evidence is not definitive and the safety of aloe has not been systematically studied."
  },
  {
    "name": "Asian Ginseng",
    "uses": "Traditional and modern uses of ginseng include improving recovery from illness, increasing stamina, enhancing both mental and physical performance, and treating conditions such as erectile dysfunction, hepatitis C, and menopausal symptoms. It is also used to help lower blood glucose and manage blood pressure.",
    "prep": "The root of Asian ginseng contains active chemical components called ginsenosides (or panaxosides), which are believed to be responsible for its medicinal properties. The root is dried and used to make tablets, capsules, extracts, and teas, as well as creams or other external preparations.",
    "warning": "Short-term use of ginseng at recommended doses appears to be safe for most people. Some sources suggest that prolonged use might cause side effects. The most common side effects include headaches, sleep problems, and gastrointestinal discomfort. Asian ginseng can cause allergic reactions. There have been reports of breast tenderness, menstrual irregularities, and high blood pressure associated with Asian ginseng products, although the specific components were not always analyzed. Asian ginseng may lower blood sugar levels, which could be more pronounced in people with diabetes. Therefore, individuals with diabetes should use caution, especially if they are also taking medications or herbs that lower blood sugar, such as bitter melon and fenugreek."
  },
  {
    "name": "Astragalus",
    "uses": "Historically, astragalus has been used in traditional Chinese medicine, typically in combination with other herbs, to support and enhance the immune system. It is still widely used in China for chronic hepatitis and as an adjunctive therapy in cancer. It is also used to prevent and treat the common cold and upper respiratory infections, and has been used for heart disease.",
    "prep": "The root of the astragalus plant is typically used in soups, teas, extracts, or capsules. Astragalus is generally used with other herbs such as ginseng, angelica, and licorice.",
    "warning": "Astragalus is considered safe for most adults. However, its possible side effects are not well known due to its common use in herbal combinations. Astragalus may interact with medications that suppress the immune system, such as drugs taken by cancer patients or organ transplant recipients. It may also affect blood sugar levels and blood pressure. Some species of astragalus, usually not found in human supplements, can be toxic. For example, certain species growing in the U.S. contain the neurotoxin swainsonine and have caused 'locoweed' poisoning in animals. Others contain potentially toxic levels of selenium."
  },
  {
    "name": "Bilberry",
    "uses": "Historically, bilberry fruit was used to treat diarrhea, scurvy, and other conditions. Today, bilberry is used for diarrhea, menstrual cramps, eye problems, varicose veins, and venous insufficiency—a condition where veins do not efficiently return blood from the legs to the heart. Bilberry leaf is used for different conditions, including diabetes.",
    "prep": "The fruit of the bilberry plant can be eaten or made into extracts. Similarly, the leaves of the bilberry plant are used to make extracts or teas.",
    "warning": "Bilberry fruit is considered safe when consumed in amounts typically found in foods or in extract form for short periods. The long-term safety and side effects have not been extensively studied. High doses or prolonged use of bilberry leaf or its extract are considered unsafe due to potential toxicity."
  },
  {
    "name": "Black Cohosh",
    "uses": "Black cohosh has a history of use for rheumatism (arthritis and muscle pain), but it has been more recently used to treat hot flashes, night sweats, vaginal dryness, and other symptoms related to menopause. It has also been used for menstrual irregularities, premenstrual syndrome, and to induce labor.",
    "prep": "The underground stems and roots of black cohosh are commonly used fresh or dried to make strong teas (infusions), capsules, solid extracts used in pills, or liquid extracts (tinctures).",
    "warning": "United States Pharmacopeia experts suggest that women should discontinue use of black cohosh and consult a healthcare practitioner if they have a liver disorder or develop symptoms of liver trouble, such as abdominal pain, dark urine, or jaundice. There have been several case reports of hepatitis (inflammation of the liver) and liver failure in women who were taking black cohosh, although it is not definitively known whether black cohosh caused these problems. Although such cases are rare, scientists remain concerned about the possible effects of black cohosh on the liver. Some people taking black cohosh have experienced side effects such as stomach discomfort, headache, or rash. In general, clinical trials of black cohosh for menopausal symptoms have not found serious side effects. Although concerns have been raised about possible interactions between black cohosh and various medications, a 2008 review concluded that the risk of such interactions appears to be small. It is not clear whether black cohosh is safe for women who have had hormone-sensitive conditions such as breast cancer, or for pregnant or nursing women. Black cohosh should not be confused with blue cohosh (Caulophyllum thalictroides), which has different properties, uses, and side effects. Black cohosh is sometimes used with blue cohosh to stimulate labor, but this combination has been associated with adverse effects in newborns, likely due to blue cohosh."
  },
  {
    "name": "Cat’s Claw",
    "uses": "Cat’s claw has been used for centuries in South America to prevent and treat diseases. It has been applied to a variety of health conditions including viral infections (such as herpes and HIV), Alzheimer’s disease, cancer, and arthritis. Cat’s claw is also used to support the immune system, promote kidney health, and, historically, to prevent or induce abortion.",
    "prep": "The inner bark of cat’s claw is used to make liquid extracts, capsules, and teas. Preparations can also be applied to the skin.",
    "warning": "Few side effects have been reported when cat’s claw is taken at recommended dosages. Rarely, it may cause headaches, dizziness, or vomiting. Women who are pregnant or trying to become pregnant should avoid using cat’s claw due to its traditional use in affecting pregnancy. Because it may stimulate the immune system, the herb’s safety for individuals with immune-related conditions is uncertain. Cat’s claw may also interfere with blood pressure regulation during or after surgery."
  },
  {
    "name": "Chamomile",
    "uses": "Chamomile has been widely used for thousands of years in both children and adults for various health conditions. It is often used to aid with sleep, reduce anxiety, and treat gastrointestinal conditions such as upset stomach, gas, and diarrhea. Topically, it is used for skin conditions and for mouth ulcers related to cancer treatment.",
    "prep": "The flowering tops of the chamomile plant are used to make teas, liquid extracts, capsules, or tablets. Chamomile can also be applied to the skin as a cream or ointment, or used as a mouth rinse.",
    "warning": "There have been reports of allergic reactions in individuals who have ingested or come into contact with chamomile products. These reactions may include skin rashes, throat swelling, shortness of breath, and anaphylaxis (a severe allergic reaction). People allergic to plants in the daisy family—such as ragweed, chrysanthemums, marigolds, and daisies—are more likely to experience allergic responses to chamomile. German chamomile is more commonly used in the U.S. and is the primary focus of most health applications."
  },
  {
    "name": "Chasteberry",
    "uses": "Chasteberry has been used for thousands of years, mainly by women, to ease menstrual problems and stimulate breast milk production. It is still used for premenstrual syndrome (PMS), menopausal symptoms, certain types of infertility, and acne.",
    "prep": "The dried ripe chasteberry is used to prepare liquid extracts or solid extracts, which are then processed into capsules and tablets.",
    "warning": "Chasteberry has not been associated with serious side effects, though it may cause gastrointestinal issues, acne-like rashes, or dizziness. Because it can affect hormone levels, it is not recommended for pregnant women, women taking birth control pills, or those with hormone-sensitive conditions such as breast cancer. Chasteberry may also interact with medications affecting dopamine, such as some antipsychotic and Parkinson’s disease drugs."
  },
  {
    "name": "Cranberry",
    "uses": "Historically, cranberry fruit and leaves were used for a variety of conditions including wounds, urinary disorders, diarrhea, diabetes, stomach ailments, and liver problems. Today, cranberry products are commonly used to prevent or treat urinary tract infections and to reduce dental plaque. They have also been studied for antioxidant and potential anticancer effects.",
    "prep": "Cranberries are used to produce beverages and many food products, as well as dietary supplements in the form of extracts, capsules, or tablets.",
    "warning": "Drinking cranberry juice products is generally considered safe, although large amounts may cause gastrointestinal upset or diarrhea. Cranberry products should not be used to replace medical treatment for urinary tract infections. They should be used cautiously by individuals taking blood thinners such as warfarin, or medications that affect the liver or interact with aspirin."
  },
  {
    "name": "Dandelion",
    "uses": "Historically, dandelion was most commonly used to treat liver diseases, kidney disorders, and spleen problems. It was also used, less frequently, for digestive issues and skin conditions. Today, dandelion is sometimes used as a liver or kidney tonic, a diuretic, and for minor digestive complaints.",
    "prep": "The leaves, roots, or entire dandelion plant are used fresh or dried in teas, capsules, or extracts. Dandelion leaves are also consumed in salads or cooked as greens, and the flowers are used to make wine.",
    "warning": "Dandelion use is generally considered safe. However, rare side effects such as upset stomach and diarrhea have been reported. Some individuals may be allergic to the plant. People with inflamed or infected gallbladders, or blocked bile ducts, should avoid using dandelion."
  },
  {
    "name": "Echinacea",
    "uses": "Echinacea has traditionally been used to treat or prevent colds, flu, and other infections. It is believed to stimulate the immune system to help fight infections. Less commonly, it has been used for wound healing and skin problems such as acne or boils.",
    "prep": "The aboveground parts and roots of the echinacea plant are used fresh or dried to make teas, expressed juice, extracts, or topical preparations.",
    "warning": "When taken by mouth, echinacea usually does not cause significant side effects. However, some people may experience allergic reactions such as rashes, asthma exacerbation, or anaphylaxis. Gastrointestinal symptoms were the most common side effects reported in clinical trials. Individuals allergic to plants in the daisy family—such as ragweed, chrysanthemums, marigolds, and daisies—may be more likely to have a reaction. People with asthma or a genetic tendency toward allergies (atopy) should exercise caution."
  },
  {
    "name": "Ephedra",
    "uses": "Ephedra has been used for more than 5,000 years in China and India to treat colds, fever, flu, headaches, asthma, wheezing, and nasal congestion. It was also an ingredient in many dietary supplements marketed for weight loss, energy, and athletic performance.",
    "prep": "The dried stems and leaves of the ephedra plant have been used to make capsules, tablets, extracts, tinctures, and teas.",
    "warning": "In 2004, the FDA banned the sale of dietary supplements containing ephedra due to serious health risks, including cardiovascular issues and death. The ban does not apply to traditional Chinese herbal remedies or food products like herbal teas. Ephedra has been associated with stroke, heart attack, seizures, and even death. It may worsen conditions such as heart disease, kidney disease, and diabetes. Side effects include anxiety, urinary difficulty, dry mouth, nausea, psychosis, restlessness, high blood pressure, and tremors. Pregnant and breastfeeding women and children should not use ephedra. Combining ephedra with caffeine greatly increases the risk of dangerous side effects."
  },
  {
    "name": "Fenugreek",
    "uses": "Historically, fenugreek was used to treat menopausal symptoms, digestive issues, and to induce childbirth. Today, it is commonly used to help manage diabetes, stimulate appetite, and increase milk production in breastfeeding women. It is also applied to the skin for inflammation.",
    "prep": "Dried fenugreek seeds are ground and taken by mouth or made into a paste for topical application.",
    "warning": "Possible side effects of fenugreek when taken orally include gas, bloating, and diarrhea. It may also cause skin irritation when applied topically. Because of its historical use to induce labor, fenugreek should be used with caution during pregnancy."
  },
  {
    "name": "Feverfew",
    "uses": "Feverfew has been used for centuries to treat fevers, headaches, stomachaches, toothaches, insect bites, infertility, and issues related to menstruation and childbirth. More recently, it has been used for migraine prevention and to alleviate rheumatoid arthritis symptoms. Feverfew has also been used for psoriasis, allergies, asthma, tinnitus, dizziness, nausea, and vomiting.",
    "prep": "The dried leaves—sometimes with flowers and stems—are used to make supplements, including capsules, tablets, and liquid extracts. The leaves may also be eaten fresh.",
    "warning": "No serious side effects have been reported with feverfew use. However, side effects may include canker sores, swelling or irritation of the lips and tongue, and loss of taste. Less common effects include nausea, digestive upset, and bloating. People who take feverfew long-term and stop abruptly may experience withdrawal symptoms such as headaches, insomnia, and joint pain. Feverfew should not be used during pregnancy due to its potential to stimulate the uterus. Allergic reactions are possible, especially in people allergic to members of the daisy family, such as ragweed and chrysanthemums."
  },
  {
    "name": "Garlic",
    "uses": "Garlic is most commonly used as a dietary supplement to manage high cholesterol, heart disease, and high blood pressure. It is also used in efforts to prevent certain cancers, including stomach and colon cancers.",
    "prep": "Garlic cloves can be eaten raw or cooked. They may also be dried or powdered and used in tablets or capsules. Raw cloves are sometimes used to prepare garlic oils and liquid extracts.",
    "warning": "Garlic is generally safe for most adults. Reported side effects include bad breath, body odor, heartburn, and upset stomach, especially when raw garlic is consumed. Garlic can thin the blood and may interfere with clotting during or after surgery. Use caution if you have a bleeding disorder or are taking blood-thinning medication. Garlic may also reduce the effectiveness of saquinavir, a drug used to treat HIV."
  },
  {
    "name": "Ginger",
    "uses": "Ginger is used in Asian medicine to treat stomach aches, nausea, and diarrhea. It is commonly included in digestive aids, anti-nausea formulations, and cold and flu supplements. Ginger is used to alleviate postsurgical nausea and nausea caused by motion, chemotherapy, or pregnancy. It has also been applied to manage symptoms of rheumatoid arthritis, osteoarthritis, and joint or muscle pain.",
    "prep": "The underground stem (rhizome) of the ginger plant is used for culinary and medicinal purposes. Forms include fresh or dried root, tablets, capsules, liquid extracts (tinctures), and teas.",
    "warning": "Few side effects are linked to ginger when taken in small doses. Common side effects include gas, bloating, heartburn, and nausea. These effects are more frequently associated with powdered ginger."
  },
  {
    "name": "Ginkgo",
    "uses": "Ginkgo leaf extract has been used to treat a variety of conditions including asthma, bronchitis, fatigue, and tinnitus. Today, it is most commonly used to improve memory and cognitive function, particularly in cases of Alzheimer’s disease and other dementias. It is also used for leg pain caused by narrowed arteries (intermittent claudication), as well as sexual dysfunction and multiple sclerosis.",
    "prep": "Extracts are usually made from ginkgo leaves and are taken in tablets, capsules, or teas. Occasionally, ginkgo extract is used in skin products.",
    "warning": "Possible side effects of ginkgo include headache, nausea, gastrointestinal upset, diarrhea, dizziness, or allergic skin reactions. Ginkgo may increase bleeding risk, so people taking anticoagulant medications or undergoing surgery should consult a healthcare provider before use. Raw ginkgo seeds contain ginkgotoxin, a compound that can cause seizures and even death. Processed extracts typically contain very low levels of this toxin and are considered safe when used properly."
  }
]